// Максимальный и минимальный углы поворота сервы
#define SERVOMIN 80
#define SERVOMAX 600

// Концевики на движение рук вверх и вниз
#define UPBORDER 9
#define DOWNBORDER 5 

// Моторы на поднятие и опускание рук
#define ARMSMOTORUP 50
#define ARMSMOTORDOWN 48

// Порт клапана
#define VALVE 13 //HIGH -- off, LOW -- on

// Порт компрессора
#define PUMP 17 //HIGH -- off, LOW -- on

// хз что это
#define LCD 3

// Номер сервы головы
const short HEAD_SERVO = 0; 

// Положения сервы головы
const short HEAD_FRONT = 47;
const short HEAD_LEFT = 30;

// Даёт положения пальцев для выбранной ноты
short fingerings[25][11] = {
    {1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1},  //C
    {1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 0},  //C#
    {1, 2, 1, 1, 1, 1, 1, 1, 0, 1, 1},  //D
    {1, 2, 1, 1, 1, 1, 1, 1, 0, 0, 1},  //D#
    {1, 2, 1, 1, 1, 1, 1, 0, 0, 1, 1},  //E
    {1, 2, 1, 1, 1, 1, 0, 0, 0, 1, 1},  //F
    {1, 2, 1, 1, 1, 0, 1, 1, 1, 1, 1},  //F#
    {1, 2, 1, 1, 1, 0, 0, 0, 0, 1, 1},  //G
    {1, 2, 1, 1, 0, 1, 1, 0, 0, 1, 1},  //G#
    {1, 2, 1, 0, 1, 1, 1, 0, 1, 1, 1},  //A
    {1, 2, 1, 0, 1, 0, 0, 0, 0, 1, 1},  //A#
    {1, 2, 0, 1, 0, 1, 0, 1, 0, 1, 1},  //B
    {1, 2, 0, 0, 0, 0, 0, 0, 0, 1, 1},  //C
    {1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1},  //C#
    // дальше надо сильнее дуть, пока мы не можем
    {1, 2, 1, 1, 1, 1, 1, 0, 0, 1, 1},  //to D# 1       14
    {1, 2, 1, 1, 1, 1, 1, 0, 0, 0, 1},  //to D# 2       15
    {1, 2, 1, 1, 1, 1, 1, 1, 0, 1, 1},  //to C# 1       16
    {1, 2, 1, 1, 1, 1, 1, 1, 0, 1, 0},  //to C# 2       17
    {1, 2, 1, 1, 1, 1, 1, 0, 0, 0, 1},  //from D# 1     18
    {1, 2, 1, 1, 1, 1, 1, 0, 0, 1, 1},  //from D# 2     19
    {1, 2, 1, 1, 1, 1, 1, 1, 0, 1, 0},  //from C# 1     20
    {1, 2, 1, 1, 1, 1, 1, 1, 0, 1, 1}}; //from C# 2     21
    
// Положение серв пальцев при открытии и закрытии ноты
short positions[11][3] = {
// open, closed
    {0, 0},     //head
    {5, 20, 40},   //1
    {25, 50},   //2
    {60, 20},   //3
    {20, 55},   //4
    {70, 20},   //5
    {60, 20},   //6
    {30, 65},   //7
    {74, 20},   //8
    {30, 5},   //9
    {22, 5}};  //10

// Соответствие виртуальных и физических номеров серв
// Виртуальный - номер в массиве
// Физический - номер порта на Ардуино
//                0, 1, 2, 3, 4,  5,  6,  7,  8,  9, 10
short servos[] = {0, 1, 2, 3, 4, 13, 15, 12, 10, 14, 11};